Ran Plan for project: `cluster` dir: `cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["app-tier"].aws_eks_node_group.this[0] has been deleted
- resource "aws_eks_node_group" "this" {
      - id                     = "TestCluster:app-tier-2024060717194736700000000d" -> null
      - labels                 = {
          - "Environment" = "TestCluster"
          - "tier"        = "app"
        } -> null
        tags                   = {
            "Creator" = "tanmay"
            "Name"    = "app-tier"
            "Purpose" = "Demo"
            "Tier"    = "app-tier"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.eks.aws_eks_addon.this["coredns"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name           = "coredns"
      + addon_version        = "v1.10.1-eksbuild.4"
      + arn                  = (known after apply)
      + cluster_name         = "TestCluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags                 = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all             = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name           = "kube-proxy"
      + addon_version        = "v1.28.2-eksbuild.2"
      + arn                  = (known after apply)
      + cluster_name         = "TestCluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags                 = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all             = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "TestCluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags                 = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all             = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
    }

  # module.eks.module.eks_managed_node_group["app-tier"].aws_eks_node_group.this[0] will be created
+ resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "TestCluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "r5a.xlarge",
        ]
      + labels                 = {
          + "Environment" = "TestCluster"
          + "tier"        = "app"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "app-tier-"
      + node_role_arn          = "arn:aws:iam::768688893088:role/app-tier-eks-node-group-20240607171134326400000003"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-039be143098cd44f8",
          + "subnet-0d3059d198f774641",
        ]
      + tags                   = {
          + "Creator" = "tanmay"
          + "Name"    = "app-tier"
          + "Purpose" = "Demo"
          + "Tier"    = "app-tier"
        }
      + tags_all               = {
          + "Creator" = "tanmay"
          + "Name"    = "app-tier"
          + "Purpose" = "Demo"
          + "Tier"    = "app-tier"
        }
      + version                = "1.28"

      + launch_template {
          + id      = (known after apply)
          + name    = "app-tier-2024060717194700920000000b"
          + version = "1"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 10
          + min_size     = 0
        }

      + timeouts {}
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cluster
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=tanmay6414%252Fopeninnovationai%252Fcluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cluster
  ```

**Note: Objects have changed outside of Terraform**
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```